driver-tests/bpelse/assign/AssignJbi/test/echoConcat_Invoke/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ech="http://stc.com/echoConcat">
  <soapenv:Body>
    <ech:item>
      <ech:value>Hello Ling</ech:value>
    </ech:item>
  </soapenv:Body>
</soapenv:Envelope>